#+AUTHOR: David R. Hill, PhD
#+TITLE: Bacterial association stimulates a complex physiological response in immature human intestinal epithelium
** Figure 1 - Supplement 2
#+begin_src R :session *R* :exports none :eval no :tangle figure_Rscripts/supplemental.R
library(ggplot2)
library(ggtree)
library(magrittr)
source("ggplot2-themes.R")
tree <- read.tree(file = "../data/ecor2/ECOR2-50.nwk")
plot <- ggtree(tree, size = 2) %>% ggtree::collapse(node = 86)
plot <- plot + geom_treescale(width = 0.015) + #xlim(NA, 100) +
  #  geom_hilight(76, "steelblue") +
    geom_tiplab(size = 7) +
    geom_cladelabel(node = 53,
                    label = "non-pathogenic E. coli",
                    align = FALSE,
                    offset = 0.01,
                    offset.text = 1e-3,
                    fontsize = 12,
                    barsize = 2) +
    #geom_text2(aes(subset=!isTip, label=node), hjust=-.3) + 
    geom_tippoint(aes(subset=(node == 26)),
                  size = 8,
                  shape = 21,
                  fill = color.set[1],
                  color = color.set[1])

    
## PDF output
pdf(file = "../figures/figure1/sfigure1-2_tree.pdf", width = 9000/300, height = 7500/300, onefile = FALSE)
print(plot)
dev.off()
#+end_src

#+RESULTS:
: 3
** Figure 1 - Supplement 2 
Minimum density /E. coli/ required to establish colonization
#+begin_src R :session *R* :exports none :eval yes :tangle figure_Rscripts/supplemental.R
,#+begin_src R :session *R* :exports none :results graphics :file ../figures/supplemental/sfigure1_supp2.pdf :eval yes :tangle figure_Rscripts/supplemental.R
## Minimum density /E. coli/ required to establish colonization 

## E. coli growth in HIOs
## Read in data table
data <- read.table("../data/figure1/ECOR2growth_fig1.csv", header = TRUE, sep = ",", stringsAsFactors=FALSE)
## Index of CFU/HIO injected for each Sample condition (A-G)
sample.table <- read.table("../data/figure1/sample_table_fig1.csv", header = TRUE, sep = ",", stringsAsFactors=FALSE)
## Generate index of rows in sample table that match
## the sample labels in data
id <- match(data$sample,sample.table$sample)
## create column in data of of CFU/HIO values in sample table
## in matching rows listed in id
data$inject <- sample.table[id,]$value
data$fold <- data$mean/data$inject
data$increase <- ifelse(data$mean > data$inject,"increase","decrease")
  
group <- aggregate(mean ~ inject, data = data, FUN = mean)
group.sem <- aggregate(mean ~ inject, data = data,
                       FUN = function(x) sd(x)/sqrt(length(x)))
group$sem <- group.sem$mean

## ANOVA of mean CFU/HIO among colonized HIOs
fit <- aov(mean ~ sample, data = data[data$inject >1,])
fit2 <- lm(log(data[data$inject > 0 & data$fold !=0,]$fold) ~ log(log(data[data$inject > 0 & data$fold !=0,]$inject)), data[data$inject > 0 & data$fold !=0,])

p1c <- summary(fit)[[1]][["Pr(>F)"]][[1]]

## % colonized at < 5 CFU
pct1 <- round(100*(1-length(rownames(data[data$inject < 5 & data$inject > 1 & data$mean < 1,] ))/length(rownames(data[data$inject < 5 & data$inject > 1 & data$mean > 1,] ))),1)

## % colonized at > 100 CFU
pct2 <- round(100*(1-length(rownames(data[data$inject > 100 & data$mean < 1,] ))/length(rownames(data[data$inject < 5 & data$inject > 1 & data$mean > 1,] ))),2)

## plot
library(ggplot2)
library(grid)
library(scales)
source("ggplot2-themes.R")

scientific_10 <- function(x) {
    parse(text=gsub("e", " %*% 10^", scientific_format()(x)))
}

## generate stats string for plot
source("custom_fun.R")
stats <- lm_eqn(data[data$inject > 0 & data$fold !=0,],
                data[data$inject > 0 & data$fold !=0,]$inject,
                data[data$inject > 0 & data$fold !=0,]$mean)


fig2c <- ggplot(data, aes(x=inject, y=mean)) +
    geom_smooth(
                aes(x=inject, y=mean), colour = "black",
                size = 2,
                method = "lm",
                formula = y ~ x,
                level = 0.95) +
  #  geom_boxplot(aes(group = inject), size =2, fill = color.set[2]) +
    geom_point(size = 8, shape =21, fill = color.set[2]) +
    scale_fill_brewer(palette = "Set1") + 
    ylab(latex2exp::TeX("$\\textbf{CFU$\\cdot{}HIO^{-1}_{$\\textit{t}=24}}$")) +
    xlab("CFU injected per HIO") + theme1 +
    scale_y_log10(limits = c(1,50000000),
                  breaks = trans_breaks("log10", function(x) 10^x),
                  labels = trans_format("log10", math_format(10^.x))) +
    scale_x_log10(limits = c(1,100000),
                  breaks = trans_breaks("log10", function(x) 10^x),
                  labels = trans_format("log10", math_format(10^.x))) +    
    annotation_logticks(sides = "bl", size = 2,
                        short = unit(.75,"mm"),
                        mid = unit(3,"mm"),
                        long = unit(5,"mm")) +
        ## size of stats label
    annotate("text",x = 5e3, y = 5e7,
                           label = substr(stats,62,150),
                           parse = TRUE,
                           size = 10) +


pdf(file = "../figures/supplemental/sfigure1_supp2.pdf", width = 10, height = 10, onefile = FALSE)
print(fig2c)
dev.off()
#+end_src

#+RESULTS:
: 1
** Figure 5 - Supplement 2

#+begin_src R :session *R* :exports none :eval yes :tangle figure_Rscripts/supplemental.R
## Figure 5 - Supplement 3
## import raw data
data <- readr::read_csv(file = "../data/figure5/170825_ELISA_results.csv")

## load libraries
library(scales)
library(grid)
library(ggplot2)
source("ggplot2-themes.R")
library(magrittr)

## statistical tests
## BD-1
bd1.p <- t.test(data[data$treatment == "PBS" & data$cytokine == "BD-1",]$pg_ml,
                data[data$treatment == "E. coli" & data$cytokine == "BD-1",]$pg_ml,
                alternative = "greater")$p.value
bd1.p2 <- t.test(data[data$treatment == "PBS" & data$cytokine == "BD-1",]$pg_ml,
                data[data$treatment == "Heat-inactivated + hypoxia" & data$cytokine == "BD-1",]$pg_ml,
                alternative = "two.sided")$p.value
bd1.p3 <- t.test(data[data$treatment == "PBS" & data$cytokine == "BD-1",]$pg_ml,
                data[data$treatment == "hypoxia" & data$cytokine == "BD-1",]$pg_ml,
                alternative = "two.sided")$p.value
## BD-2
bd2.p <- t.test(data[data$treatment == "PBS" & data$cytokine == "BD-2",]$pg_ml,
                data[data$treatment == "E. coli" & data$cytokine == "BD-2",]$pg_ml,
                alternative = "less")$p.value
bd2.p2 <- t.test(data[data$treatment == "PBS" & data$cytokine == "BD-2",]$pg_ml,
                data[data$treatment == "Heat-inactivated + hypoxia" & data$cytokine == "BD-2",]$pg_ml,
                alternative = "less")$p.value
## IL-6
il6.p <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-6",]$pg_ml,
                data[data$treatment == "E. coli" & data$cytokine == "IL-6",]$pg_ml,
                alternative = "less")$p.value
il6.p2 <- t.test(data[data$treatment == "Heat-inactivated + hypoxia" & data$cytokine == "IL-6",]$pg_ml,
                data[data$treatment == "E. coli" & data$cytokine == "IL-6",]$pg_ml,
                alternative = "less")$p.value
il6.p3 <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-6",]$pg_ml,
                data[data$treatment == "Heat-inactivated + hypoxia" & data$cytokine == "IL-6",]$pg_ml,
                alternative = "less")$p.value
il6.p4 <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-6",]$pg_ml,
                data[data$treatment == "Heat-inactivated" & data$cytokine == "IL-6",]$pg_ml,
                alternative = "less")$p.value
il6.p5 <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-6",]$pg_ml,
                data[data$treatment == "hypoxia" & data$cytokine == "IL-6",]$pg_ml,
                alternative = "less")$p.value
## IL-8
il8.p <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-8",]$pg_ml,
                data[data$treatment == "E. coli" & data$cytokine == "IL-8",]$pg_ml,
                alternative = "less")$p.value
il8.p2 <- t.test(data[data$treatment == "Heat-inactivated + hypoxia" & data$cytokine == "IL-8",]$pg_ml,
                data[data$treatment == "E. coli" & data$cytokine == "IL-8",]$pg_ml,
                alternative = "less")$p.value
il8.p3 <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-8",]$pg_ml,
                data[data$treatment == "Heat-inactivated + hypoxia" & data$cytokine == "IL-8",]$pg_ml,
                alternative = "less")$p.value
il8.p4 <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-8",]$pg_ml,
                data[data$treatment == "Heat-inactivated" & data$cytokine == "IL-8",]$pg_ml,
                alternative = "less")$p.value
il8.p5 <- t.test(data[data$treatment == "PBS" & data$cytokine == "IL-8",]$pg_ml,
                data[data$treatment == "hypoxia" & data$cytokine == "IL-8",]$pg_ml,
                alternative = "less")$p.value

## VEGF
vegf.p <- t.test(data[data$treatment == "Heat-inactivated" & data$cytokine == "VEGF",]$pg_ml,
                data[data$treatment == "E. coli" & data$cytokine == "VEGF",]$pg_ml,
                alternative = "less")$p.value


data <- dplyr::group_by(data, treatment, cytokine) %>%
    dplyr::summarise(avg = mean(pg_ml),
                     num = n(),
                     sem = sd(pg_ml, na.rm = TRUE) / n(),
                     total = sum(pg_ml, na.rm = TRUE))

data$treatment <- factor(data$treatment,
                         levels = c("PBS",
                                    "E. coli",
                                    "Heat-inactivated",
                                    "hypoxia",
                                    "Heat-inactivated + hypoxia")
                         )



elisa <- ggplot(data,
                aes(x = treatment, y = avg,
                    fill = factor(treatment),
                    color = factor(treatment))) +
    geom_bar(stat = "identity") +
    geom_errorbar(aes(ymax = avg + sem,
                      ymin = avg - sem),
                  width = 0, color = "grey70", size = 2) +
    facet_wrap(~cytokine, scales = "free_y") +
    xlab("") +
    ylab("pg/ml") +
    scale_fill_brewer(palette = "Set1", direction = 1) +
    scale_color_brewer(palette = "Set1", direction = 1) +
    ## statistical annotations
    ## BD-1
    geom_segment(data = data[data$cytokine == "BD-1",],
                 aes(x = 1,
                     xend = 2, 
                     y = 53+4,
                     yend = 53+4),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "BD-1",],
                 aes(x = 1.5,
                     y = 55+4),
              color = "grey30",
              label = paste("P = ", format(bd1.p, digits = 1))) +
    geom_segment(data = data[data$cytokine == "BD-1",],
                 aes(x = 1,
                     xend = 5, 
                     y = 73+4,
                     yend = 73+4),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "BD-1",],
                 aes(x = 3,
                     y = 75+4),
              color = "grey30",
              label = paste("P = ", format(bd1.p2, digits = 1))) +
    geom_segment(data = data[data$cytokine == "BD-1",],
                 aes(x = 1,
                     xend = 4, 
                     y = 73,
                     yend = 73),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "BD-1",],
                 aes(x = 2.5,
                     y = 75),
              color = "grey30",
              label = paste("P = ", format(bd1.p3, digits = 1))) +
    ## BD-2
    geom_segment(data = data[data$cytokine == "BD-2",],
                 aes(x = 1,
                     xend = 2, 
                     y = 750,
                     yend = 750),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "BD-2",],
                 aes(x = 1.5,
                     y = 750+20),
              color = "grey30",
              label = paste("P = ", format(bd2.p, digits = 1))) +
    geom_segment(data = data[data$cytokine == "BD-2",],
                 aes(x = 1,
                     xend = 5, 
                     y = 750+40,
                     yend = 750+40),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "BD-2",],
                 aes(x = 3,
                     y = 750+60),
              color = "grey30",
              label = paste("P = ", format(bd2.p2, digits = 1))) +
    ## IL-6
    geom_segment(data = data[data$cytokine == "IL-6",],
                 aes(x = 1,
                     xend = 2, 
                     y = 160,
                     yend = 160),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "IL-6",],
                 aes(x = 1.5,
                     y = 160+10),
              color = "grey30",
              label = paste("P = ", format(il6.p, digits = 1))) +
    geom_segment(data = data[data$cytokine == "IL-6",],
                 aes(x = 1,
                     xend = 3, 
                     y = 160+20,
                     yend = 160+20),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "IL-6",],
                 aes(x = 2,
                     y = 160+30),
              color = "grey30",
              label = paste("P = ", format(il6.p4, digits = 1))) +
    geom_segment(data = data[data$cytokine == "IL-6",],
                 aes(x = 1,
                     xend = 4, 
                     y = 160+40,
                     yend = 160+40),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "IL-6",],
                 aes(x = 2.5,
                     y = 160+50),
              color = "grey30",
              label = paste("P = ", format(il6.p5, digits = 1))) +
    geom_segment(data = data[data$cytokine == "IL-6",],
                 aes(x = 1,
                     xend = 5, 
                     y = 160+60,
                     yend = 160+60),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "IL-6",],
                 aes(x = 3,
                     y = 160+70),
              color = "grey30",
              label = paste("P = ", format(il6.p3, digits = 1))) +
    ## IL-8
    geom_segment(data = data[data$cytokine == "IL-8",],
                 aes(x = 1,
                     xend = 2, 
                     y = 2100,
                     yend = 2100),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "IL-8",],
                 aes(x = 1.5,
                     y = 2100+100),
              color = "grey30",
              label = paste("P = ", format(il8.p, digits = 1))) +
    geom_segment(data = data[data$cytokine == "IL-8",],
                 aes(x = 1,
                     xend = 4, 
                     y = 2700,
                     yend = 2700),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "IL-8",],
                 aes(x = 2.5,
                     y = 2700+100),
              color = "grey30",
              label = paste("P = ", format(il8.p5, digits = 1))) +
    geom_segment(data = data[data$cytokine == "IL-8",],
                 aes(x = 1,
                     xend = 5, 
                     y = 3800,
                     yend = 3800),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "IL-8",],
                 aes(x = 3,
                     y = 3800+100),
              color = "grey30",
              label = paste("P = ", format(il8.p3, digits = 1))) +
    ## VEGF
    geom_segment(data = data[data$cytokine == "VEGF",],
                 aes(x = 2,
                     xend = 3, 
                     y = 650,
                     yend = 650),
                 size = 1,
		 color = "grey30")+
    geom_text(data = data[data$cytokine == "VEGF",],
                 aes(x = 2.5,
                     y = 650+25),
              color = "grey30",
              label = paste("P = ", format(vegf.p, digits = 1))) +
    theme1 +
    theme(axis.text.x = element_text(angle = 45,
                                     vjust = 1,
                                     hjust = 1),
          strip.text = element_text(color = "white", size = 24),
	  strip.background = element_rect(color = "white",
                                          fill = "grey30"))
pdf(file = "../figures/supplemental/sfigure5_supp3.pdf", width = 18, height = 15, onefile = FALSE)
print(elisa)
dev.off()
#+end_src

#+RESULTS:
: 1

